_posts/2013-06-13-Reading-and-writing-pdf-metadata.html
---
title: Reading and writing pdf metadata
date: 2013/06/13 10:19:43
updated: 2013/06/13 10:19:43
categories: programming
tags: 
---


<p>
One key to automating analysis of files is that data be stored in files in a way that is easy to add and retrieve. I have been examining ways to add grades to files so that a program could read the file, extract the grade, and collect it in a gradebook. 
</p>

<p>
PDF files could be one format where this is possible. The idea is that students would turn in a PDF file as their homework. The assignment would be graded, perhaps with hand-written markup from a tablet, and the grader would enter the grade as custom metadata in the file. Later a program would read the grade in and compile the results. 
</p>

<p>
In this post I examine some python modules that can do this. There are several python modules that can interact with PDF files.
</p>

<ol class="org-ol">
<li><a href="http://pybrary.net/pyPdf/">pyPDF</a> (seems to be replaced by <a href="http://knowah.github.io/PyPDF2/">PyPDF2</a>).
</li>
<li><a href="http://code.google.com/p/pdfrw/">pdfrw</a>
</li>
<li><a href="http://www.unixuser.org/~euske/python/pdfminer/index.html">pdfMiner</a> (seems to be read-only)
</li>
</ol>

<p>
All of these can be installed with pip. First, we look at getting existing information from a PDF file. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> pyPdf <span style="color: #8b0000;">import</span> PdfFileReader, PdfFileWriter

fname = <span style="color: #228b22;">'../../../Desktop/Program Organizer Controls.pdf'</span>

pdf = PdfFileReader(<span style="color: #8b0000;">open</span>(fname, <span style="color: #228b22;">'rb'</span>))

<span style="color: #8b0000;">print</span> pdf.getDocumentInfo()
</pre>
</div>

<pre class="example">
{'/Creator': u'Bluebeam Stapler 10.2.1', '/Author': u'John Kitchin', '/Producer': u'Bluebeam Brewery 5.0', '/CreationDate': u"D:20130612143804-04'00'", '/ModDate': u"D:20130613095927-04'00'"}
</pre>

<p>
That is pretty straightfoward. Now, let us add some new metadata. We will create a <code>Grade</code> metadata, and store the grade in it. It appears we need to read in the pdf file, add its pages and metadata to a writer, set the new metadata, and then write out the file.
</p>

<p>
It seems that we cannot directly modify the PDF file, so we will write out to a new file, delete the old file, and rename the new file to the old file.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> pyPdf <span style="color: #8b0000;">import</span> PdfFileReader, PdfFileWriter
<span style="color: #8b0000;">from</span> pyPdf.generic <span style="color: #8b0000;">import</span> NameObject, createStringObject

inpfn = <span style="color: #228b22;">'../../../Desktop/Program Organizer Controls.pdf'</span>

fin = <span style="color: #8b0000;">file</span>(inpfn, <span style="color: #228b22;">'rb'</span>)
pdf_in = PdfFileReader(fin)

writer = PdfFileWriter()

<span style="color: #8b0000;">for</span> page <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(pdf_in.getNumPages()):
    writer.addPage(pdf_in.getPage(page))

infoDict = writer._info.getObject()

info = pdf_in.documentInfo
<span style="color: #8b0000;">for</span> key <span style="color: #8b0000;">in</span> info:
    infoDict.update({NameObject(key): createStringObject(info[key])})

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">add the grade</span>
infoDict.update({NameObject(<span style="color: #228b22;">'/Grade'</span>): createStringObject(u<span style="color: #228b22;">'A+'</span>)})

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">It does not appear possible to alter in place.</span>
fout = <span style="color: #8b0000;">open</span>(inpfn+<span style="color: #228b22;">'out.pdf'</span>, <span style="color: #228b22;">'wb'</span>)

writer.write(fout)
fin.close()
fout.close()

<span style="color: #8b0000;">import</span> os
os.unlink(inpfn)
os.rename(inpfn+<span style="color: #228b22;">'out.pdf'</span>, inpfn)
</pre>
</div>

<p>
Finally, we can see we successfully modified the file.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> pyPdf <span style="color: #8b0000;">import</span> PdfFileReader, PdfFileWriter

fname = <span style="color: #228b22;">'../../../Desktop/Program Organizer Controls.pdf'</span>

pdf = PdfFileReader(<span style="color: #8b0000;">open</span>(fname, <span style="color: #228b22;">'rb'</span>))

<span style="color: #8b0000;">print</span> pdf.getDocumentInfo()
<span style="color: #8b0000;">print</span> pdf.getDocumentInfo()[<span style="color: #228b22;">'/Grade'</span>]
</pre>
</div>

<pre class="example">
{'/Grade': u'A+', '/CreationDate': u"D:20130612143804-04'00'", '/Producer': u'Bluebeam Brewery 5.0', '/Creator': u'Bluebeam Stapler 10.2.1', '/ModDate': u"D:20130613095927-04'00'", '/Author': u'John Kitchin'}
A+
</pre>

<p>
You can see we were able to successfully add a Grade metadata field. It is stored as a Custom Document Property in my PDF viewer. I am not sure how easy it would be for a grader to enter this into a PDF. It could be possible to automate this with some kind of script that made a decent workflow. For example an org-mode file could have links that open the PDF, allow you to grade it. Then, you could click on another link that would prompt you for the grade, and then add it to the pdf. Or maybe a small script could be written that would open the pdf, wait for your to close it, then prompt you for the grade before moving to the next one.
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/06/13/Reading-and-writing-pdf-metadata.org">org-mode source</a><p>